#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: post

#+HUGO_AUTO_SET_LASTMOD: nil

#+TITLE: Discrete Distributions - Part 2

#+DATE: 2019-06-16

#+HUGO_TAGS: "probability distribution" "discrete distribution"
#+HUGO_CATEGORIES: "statistics" "probability"
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Peter Lo"

#+HUGO_DRAFT: false

In the previous post, we have looked at some basic concepts of
distributions of discrete random variable. In this post we look at
some examples of common discrete random variables, including discrete
uniform distribution, Bernoulli distribution, Binomial distribution,
Geometric distribution, Negative binomial distribution and Poisson
distribution.
# summary

*** Expected value
If the discrete uniformly distributed random variable is real-valued,
we can calculate its expected value and variance. For example, if the
possible values are the integers 1, 2, 3, 4, 5 and 6, then the
expected value is
#+begin_src R :exports both
(1 + 2 + 3 + 4 + 5 + 6)/6
#+end_src

#+RESULTS:
: 3.5

And the variance would be
#+begin_src R :exports both
(1^2 + 2^2 + 3^2 + 4^2 + 5^2 + 6^2)/6 - 3.5^2
#+end_src

#+RESULTS:
: 2.91666666666667

If the possible values are 1, 236 and 12, then the expected value
would be
#+begin_src R :exports both
(1 + 236 + 12)/3
#+end_src

#+RESULTS:
: 83

And the variance would be
#+begin_src R :exports both
(1^2 + 236^2 + 12^2)/3 - 83^2
#+end_src

#+RESULTS:
: 11724.6666666667

